zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00064.atdf
        <register name="anti_tamper__SOFTTAMP" offset="0x218" rw="RW" size="4" initval="0x00000000" caption="Software triggered tamper.">
          <bitfield name="ACTIVE" caption="Tamper active." mask="0x1"/>
          <bitfield name="ID" caption="Tamper ID." mask="0x1F00"/>
          <bitfield name="PROTKEY" caption="Protection key (0x4BEE)." mask="0xFFFF0000"/>
        </register>
        <register name="anti_tamper__RAWSTAT" offset="0x21C" rw="R" size="4" initval="0x00000000" caption="Raw status.">
          <bitfield name="RAWSTAT" caption="Raw status." mask="0xFFFFFFFF"/>
        </register>
        <register name="anti_tamper__STAT" offset="0x220" rw="RW" size="4" initval="0x00000001" caption="Status (write to clear).">
          <bitfield name="STAT" caption="Status (write to clear)." mask="0xFFFFFFFF"/>
        </register>
        <register name="anti_tamper__TIMESTAMP" offset="0x224" rw="R" size="4" initval="0x00000000" caption="Timestamp for the last tamper.">
          <bitfield name="TIMESTAMP" caption="Timestamp for the last tamper." mask="0xFFFFFFFF"/>
        </register>
        <register name="anti_tamper__FILTERCNT" offset="0x228" rw="R" size="4" initval="0x00000000" caption="Current value of filter counter.">
          <bitfield name="FILTERCNT" caption="Current value of filter counter." mask="0xFFFFFFFF"/>
        </register>
        <register name="anti_tamper__SOFTINFO" offset="0x22C" rw="RW" size="4" initval="0x00000000" caption="Register for software purpose only.">
          <bitfield name="SOFTINFO" caption="Register for software purpose only." mask="0xFFFFFFFF"/>
        </register>
        <register name="anti_tamper__TAMPERFLAG" offset="0x230" rw="RW" size="4" initval="0x00000000" caption="The 1-bit TAMPERFLAG register directly controls the TAMPER_FLAG output.">
          <bitfield name="TAMPERFLAG" caption="The 1-bit TAMPERFLAG register directly controls the TAMPER_FLAG output." mask="0x1"/>
        </register>
        <register name="anti_tamper__SOFTRESET" offset="0x234" rw="R" size="4" atomic-op="set:anti_tamper__SOFTRESET" initval="0x00000000" caption="Reading the SOFTLVL4 register returns 1 if any active soft tamper has a level of 4 or above.">
          <bitfield name="SOFTRESET" caption="Reading the SOFTLVL4 register returns 1 if any active soft tamper has a level of 4 or above." mask="0x1"/>
        </register>
      </register-group>
      <value-group name="CTRLA__PRIV">
        <value name="0" caption="AT registers accessible in privileged and unprivileged modes." value="0"/>
        <value name="1" caption="AT registers only accessible in privileged mode." value="1"/>
      </value-group>
    </module>
    <module name="BROMC" id="04402" name2="prm_boot_ahb_v2" version="2a0" caption="ARM GF55LPx Boot ROM Controller Macro">
      <register-group name="BROMC" caption="ARM GF55LPx Boot ROM Controller Macro">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000002" caption="Control A REGISTER">
          <bitfield name="SWRST" caption="Software Reset bit" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable bit" mask="0x2" values="CTRLA__ENABLE"/>
          <bitfield name="PRIV" caption="Privileged Access Only" mask="0x4" values="CTRLA__PRIV"/>
          <bitfield name="PRMWS" caption="ROM Access Time Wait State" mask="0x700" values="CTRLA__PRMWS"/>
        </register>
        <register name="UCFG" offset="0x4" rw="R" size="4" initval="0x00000001" caption="User Configuration REGISTER">
          <bitfield name="BCRCDIS" caption="Boot CRC Disable" mask="0x1" values="UCFG__BCRCDIS"/>
        </register>
      </register-group>
      <value-group name="CTRLA__ENABLE">
        <value name="0" caption="Disable ROM read access and power down the ROM. The ROM PGEN input is driven high. The ROM will clamp outputs to 1 and disable all internal current sinks. Refer to the ROM compiler specification for details on powering down the ROM." value="0"/>
        <value name="1" caption="Enable ROM read access, power up the ROM. The ROM PGEN input is driven low." value="1"/>
      </value-group>
      <value-group name="CTRLA__PRIV">
        <value name="0" caption="Macro register accessible in privileged and unprivileged modes" value="0"/>
        <value name="1" caption="Macro registers only accessible in privileged mode" value="1"/>
      </value-group>
      <value-group name="CTRLA__PRMWS">
        <value name="0" caption="No wait states, single cycle access" value="0"/>
        <value name="1" caption="Access time extended 2 clock cycles" value="1"/>
        <value name="2" caption="Access time extended to 3 clock cycles" value="2"/>
        <value name="7" caption="Access time extended to 8 clock cycles" value="7"/>
      </value-group>
      <value-group name="UCFG__BCRCDIS">
        <value name="0" caption="Boot ROM content is CRC verified by the ROM controller, status is reported to the DSU. On CRC failure, the controller blocks access to the ROM controller." value="0"/>
        <value name="1" caption="No CRC verification at Boot." value="1"/>
      </value-group>
    </module>
    <module name="CAN" id="05010" name2="can_fd_apb_v1" version="1a0" caption="Control Area Network">
      <register-group name="CAN" caption="Control Area Network">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control A Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="PRIV" caption="Priveged Access" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run during standby" mask="0x40"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Control B Register">
          <bitfield name="OFFSET" caption="Message RAM Base Address Offset." mask="0xFF0000"/>
        </register>
        <register name="INTENCLR" offset="0x28" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear register">
          <bitfield name="DBG" caption="Debug Message Interrupt Disable" mask="0x1"/>
          <bitfield name="BERR" caption="Bus Error Interrupt Enable" mask="0x2"/>
        </register>
