zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00064.atdf
        <register name="RXESC" offset="0x1BC" rw="RW" size="4" initval="0x00000000" caption="Rx Buffer / FIFO Element Size Configuration">
          <bitfield name="F0DS" caption="Rx FIFO 0 Data Field Size" mask="0x7" values="RXESC__F0DS"/>
          <bitfield name="F1DS" caption="Rx FIFO 1 Data Field Size" mask="0x70" values="RXESC__F1DS"/>
          <bitfield name="RBDS" caption="Rx Buffer Data Field Size" mask="0x700" values="RXESC__RBDS"/>
        </register>
        <register name="TXBC" offset="0x1C0" rw="RW" size="4" initval="0x00000000" caption="Tx Buffer Configuration">
          <bitfield name="TBSA" caption="Tx Buffers Start Address" mask="0xFFFC"/>
          <bitfield name="NDTB" caption="Number of Dedicated Transmit Buffers" mask="0x3F0000"/>
          <bitfield name="TFQS" caption="Transmit FIFO/Queue Size" mask="0x3F000000"/>
          <bitfield name="TFQM" caption="Tx FIFO/Queue Mode" mask="0x40000000"/>
        </register>
        <register name="TXFQS" offset="0x1C4" rw="R" size="4" initval="0x00000000" caption="Tx FIFO / Queue Status">
          <bitfield name="TFFL" caption="Tx FIFO Free Level" mask="0x3F"/>
          <bitfield name="TFGI" caption="Tx FIFO Get Index" mask="0x1F00"/>
          <bitfield name="TFQPI" caption="Tx FIFO/Queue Put Index" mask="0x1F0000"/>
          <bitfield name="TFQF" caption="Tx FIFO/Queue Full" mask="0x200000"/>
        </register>
        <register name="TXESC" offset="0x1C8" rw="RW" size="4" initval="0x00000000" caption="Tx Buffer Element Size Configuration">
          <bitfield name="TBDS" caption="Tx Buffer Data Field Size" mask="0x7" values="TXESC__TBDS"/>
        </register>
        <register name="TXBRP" offset="0x1CC" rw="R" size="4" initval="0x00000000" caption="Tx Buffer Request Pending">
          <bitfield name="TRP0" caption="Transmission Request Pending 0" mask="0x1"/>
          <bitfield name="TRP1" caption="Transmission Request Pending 1" mask="0x2"/>
          <bitfield name="TRP2" caption="Transmission Request Pending 2" mask="0x4"/>
          <bitfield name="TRP3" caption="Transmission Request Pending 3" mask="0x8"/>
          <bitfield name="TRP4" caption="Transmission Request Pending 4" mask="0x10"/>
          <bitfield name="TRP5" caption="Transmission Request Pending 5" mask="0x20"/>
          <bitfield name="TRP6" caption="Transmission Request Pending 6" mask="0x40"/>
          <bitfield name="TRP7" caption="Transmission Request Pending 7" mask="0x80"/>
          <bitfield name="TRP8" caption="Transmission Request Pending 8" mask="0x100"/>
          <bitfield name="TRP9" caption="Transmission Request Pending 9" mask="0x200"/>
          <bitfield name="TRP10" caption="Transmission Request Pending 10" mask="0x400"/>
          <bitfield name="TRP11" caption="Transmission Request Pending 11" mask="0x800"/>
          <bitfield name="TRP12" caption="Transmission Request Pending 12" mask="0x1000"/>
          <bitfield name="TRP13" caption="Transmission Request Pending 13" mask="0x2000"/>
          <bitfield name="TRP14" caption="Transmission Request Pending 14" mask="0x4000"/>
          <bitfield name="TRP15" caption="Transmission Request Pending 15" mask="0x8000"/>
          <bitfield name="TRP16" caption="Transmission Request Pending 16" mask="0x10000"/>
          <bitfield name="TRP17" caption="Transmission Request Pending 17" mask="0x20000"/>
          <bitfield name="TRP18" caption="Transmission Request Pending 18" mask="0x40000"/>
          <bitfield name="TRP19" caption="Transmission Request Pending 19" mask="0x80000"/>
          <bitfield name="TRP20" caption="Transmission Request Pending 20" mask="0x100000"/>
          <bitfield name="TRP21" caption="Transmission Request Pending 21" mask="0x200000"/>
          <bitfield name="TRP22" caption="Transmission Request Pending 22" mask="0x400000"/>
          <bitfield name="TRP23" caption="Transmission Request Pending 23" mask="0x800000"/>
          <bitfield name="TRP24" caption="Transmission Request Pending 24" mask="0x1000000"/>
          <bitfield name="TRP25" caption="Transmission Request Pending 25" mask="0x2000000"/>
          <bitfield name="TRP26" caption="Transmission Request Pending 26" mask="0x4000000"/>
          <bitfield name="TRP27" caption="Transmission Request Pending 27" mask="0x8000000"/>
          <bitfield name="TRP28" caption="Transmission Request Pending 28" mask="0x10000000"/>
          <bitfield name="TRP29" caption="Transmission Request Pending 29" mask="0x20000000"/>
          <bitfield name="TRP30" caption="Transmission Request Pending 30" mask="0x40000000"/>
          <bitfield name="TRP31" caption="Transmission Request Pending 31" mask="0x80000000"/>
        </register>
        <register name="TXBAR" offset="0x1D0" rw="RW" size="4" initval="0x00000000" caption="Tx Buffer Add Request">
          <bitfield name="AR0" caption="Add Request 0" mask="0x1"/>
          <bitfield name="AR1" caption="Add Request 1" mask="0x2"/>
          <bitfield name="AR2" caption="Add Request 2" mask="0x4"/>
          <bitfield name="AR3" caption="Add Request 3" mask="0x8"/>
          <bitfield name="AR4" caption="Add Request 4" mask="0x10"/>
          <bitfield name="AR5" caption="Add Request 5" mask="0x20"/>
          <bitfield name="AR6" caption="Add Request 6" mask="0x40"/>
          <bitfield name="AR7" caption="Add Request 7" mask="0x80"/>
          <bitfield name="AR8" caption="Add Request 8" mask="0x100"/>
          <bitfield name="AR9" caption="Add Request 9" mask="0x200"/>
          <bitfield name="AR10" caption="Add Request 10" mask="0x400"/>
          <bitfield name="AR11" caption="Add Request 11" mask="0x800"/>
          <bitfield name="AR12" caption="Add Request 12" mask="0x1000"/>
          <bitfield name="AR13" caption="Add Request 13" mask="0x2000"/>
          <bitfield name="AR14" caption="Add Request 14" mask="0x4000"/>
          <bitfield name="AR15" caption="Add Request 15" mask="0x8000"/>
          <bitfield name="AR16" caption="Add Request 16" mask="0x10000"/>
          <bitfield name="AR17" caption="Add Request 17" mask="0x20000"/>
          <bitfield name="AR18" caption="Add Request 18" mask="0x40000"/>
          <bitfield name="AR19" caption="Add Request 19" mask="0x80000"/>
          <bitfield name="AR20" caption="Add Request 20" mask="0x100000"/>
          <bitfield name="AR21" caption="Add Request 21" mask="0x200000"/>
          <bitfield name="AR22" caption="Add Request 22" mask="0x400000"/>
          <bitfield name="AR23" caption="Add Request 23" mask="0x800000"/>
          <bitfield name="AR24" caption="Add Request 24" mask="0x1000000"/>
          <bitfield name="AR25" caption="Add Request 25" mask="0x2000000"/>
          <bitfield name="AR26" caption="Add Request 26" mask="0x4000000"/>
          <bitfield name="AR27" caption="Add Request 27" mask="0x8000000"/>
          <bitfield name="AR28" caption="Add Request 28" mask="0x10000000"/>
          <bitfield name="AR29" caption="Add Request 29" mask="0x20000000"/>
          <bitfield name="AR30" caption="Add Request 30" mask="0x40000000"/>
          <bitfield name="AR31" caption="Add Request 31" mask="0x80000000"/>
        </register>
        <register name="TXBCR" offset="0x1D4" rw="RW" size="4" initval="0x00000000" caption="Tx Buffer Cancellation Request">
          <bitfield name="CR0" caption="Cancellation Request 0" mask="0x1"/>
          <bitfield name="CR1" caption="Cancellation Request 1" mask="0x2"/>
          <bitfield name="CR2" caption="Cancellation Request 2" mask="0x4"/>
          <bitfield name="CR3" caption="Cancellation Request 3" mask="0x8"/>
          <bitfield name="CR4" caption="Cancellation Request 4" mask="0x10"/>
          <bitfield name="CR5" caption="Cancellation Request 5" mask="0x20"/>
          <bitfield name="CR6" caption="Cancellation Request 6" mask="0x40"/>
          <bitfield name="CR7" caption="Cancellation Request 7" mask="0x80"/>
          <bitfield name="CR8" caption="Cancellation Request 8" mask="0x100"/>
          <bitfield name="CR9" caption="Cancellation Request 9" mask="0x200"/>
          <bitfield name="CR10" caption="Cancellation Request 10" mask="0x400"/>
          <bitfield name="CR11" caption="Cancellation Request 11" mask="0x800"/>
          <bitfield name="CR12" caption="Cancellation Request 12" mask="0x1000"/>
          <bitfield name="CR13" caption="Cancellation Request 13" mask="0x2000"/>
          <bitfield name="CR14" caption="Cancellation Request 14" mask="0x4000"/>
          <bitfield name="CR15" caption="Cancellation Request 15" mask="0x8000"/>
          <bitfield name="CR16" caption="Cancellation Request 16" mask="0x10000"/>
          <bitfield name="CR17" caption="Cancellation Request 17" mask="0x20000"/>
          <bitfield name="CR18" caption="Cancellation Request 18" mask="0x40000"/>
          <bitfield name="CR19" caption="Cancellation Request 19" mask="0x80000"/>
          <bitfield name="CR20" caption="Cancellation Request 20" mask="0x100000"/>
          <bitfield name="CR21" caption="Cancellation Request 21" mask="0x200000"/>
          <bitfield name="CR22" caption="Cancellation Request 22" mask="0x400000"/>
          <bitfield name="CR23" caption="Cancellation Request 23" mask="0x800000"/>
          <bitfield name="CR24" caption="Cancellation Request 24" mask="0x1000000"/>
          <bitfield name="CR25" caption="Cancellation Request 25" mask="0x2000000"/>
          <bitfield name="CR26" caption="Cancellation Request 26" mask="0x4000000"/>
          <bitfield name="CR27" caption="Cancellation Request 27" mask="0x8000000"/>
          <bitfield name="CR28" caption="Cancellation Request 28" mask="0x10000000"/>
          <bitfield name="CR29" caption="Cancellation Request 29" mask="0x20000000"/>
          <bitfield name="CR30" caption="Cancellation Request 30" mask="0x40000000"/>
          <bitfield name="CR31" caption="Cancellation Request 31" mask="0x80000000"/>
        </register>
        <register name="TXBTO" offset="0x1D8" rw="R" size="4" initval="0x00000000" caption="Tx Buffer Transmission Occurred">
          <bitfield name="TO0" caption="Transmission Occurred 0" mask="0x1"/>
          <bitfield name="TO1" caption="Transmission Occurred 1" mask="0x2"/>
          <bitfield name="TO2" caption="Transmission Occurred 2" mask="0x4"/>
          <bitfield name="TO3" caption="Transmission Occurred 3" mask="0x8"/>
          <bitfield name="TO4" caption="Transmission Occurred 4" mask="0x10"/>
          <bitfield name="TO5" caption="Transmission Occurred 5" mask="0x20"/>
          <bitfield name="TO6" caption="Transmission Occurred 6" mask="0x40"/>
          <bitfield name="TO7" caption="Transmission Occurred 7" mask="0x80"/>
          <bitfield name="TO8" caption="Transmission Occurred 8" mask="0x100"/>
          <bitfield name="TO9" caption="Transmission Occurred 9" mask="0x200"/>
          <bitfield name="TO10" caption="Transmission Occurred 10" mask="0x400"/>
          <bitfield name="TO11" caption="Transmission Occurred 11" mask="0x800"/>
          <bitfield name="TO12" caption="Transmission Occurred 12" mask="0x1000"/>
          <bitfield name="TO13" caption="Transmission Occurred 13" mask="0x2000"/>
          <bitfield name="TO14" caption="Transmission Occurred 14" mask="0x4000"/>
          <bitfield name="TO15" caption="Transmission Occurred 15" mask="0x8000"/>
          <bitfield name="TO16" caption="Transmission Occurred 16" mask="0x10000"/>
          <bitfield name="TO17" caption="Transmission Occurred 17" mask="0x20000"/>
          <bitfield name="TO18" caption="Transmission Occurred 18" mask="0x40000"/>
          <bitfield name="TO19" caption="Transmission Occurred 19" mask="0x80000"/>
          <bitfield name="TO20" caption="Transmission Occurred 20" mask="0x100000"/>
          <bitfield name="TO21" caption="Transmission Occurred 21" mask="0x200000"/>
          <bitfield name="TO22" caption="Transmission Occurred 22" mask="0x400000"/>
          <bitfield name="TO23" caption="Transmission Occurred 23" mask="0x800000"/>
          <bitfield name="TO24" caption="Transmission Occurred 24" mask="0x1000000"/>
          <bitfield name="TO25" caption="Transmission Occurred 25" mask="0x2000000"/>
          <bitfield name="TO26" caption="Transmission Occurred 26" mask="0x4000000"/>
          <bitfield name="TO27" caption="Transmission Occurred 27" mask="0x8000000"/>
          <bitfield name="TO28" caption="Transmission Occurred 28" mask="0x10000000"/>
          <bitfield name="TO29" caption="Transmission Occurred 29" mask="0x20000000"/>
          <bitfield name="TO30" caption="Transmission Occurred 30" mask="0x40000000"/>
          <bitfield name="TO31" caption="Transmission Occurred 31" mask="0x80000000"/>
        </register>
