zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00064.atdf
      <value-group name="CHANNEL__EDGSEL">
        <value name="NO_EVT_OUTPUT" caption="No event output when using the resynchronized or synchronous path" value="0"/>
        <value name="RISING_EDGE" caption="Event detection only on the rising edge of the signal from the event generator when using the resynchronized or synchronous path" value="1"/>
        <value name="FALLING_EDGE" caption="Event detection only on the falling edge of the signal from the event generator when using the resynchronized or synchronous path" value="2"/>
        <value name="BOTH_EDGES" caption="Event detection on rising and falling edges of the signal from the event generator when using the resynchronized or synchronous path" value="3"/>
      </value-group>
    </module>
    <module name="FCR" id="04972" name2="pfm_ctrlr_apb_v2" version="2a0" caption="Polaris Flash Read Controller">
      <register-group name="FCR" caption="Polaris Flash Read Controller">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00008000" caption="CTRL A REGISTER">
          <bitfield name="PRIV" caption="Privileged Access Only" mask="0x4" values="CTRLA__PRIV"/>
          <bitfield name="FWS" caption="Flash Access Time Defined in terms of AHB Clock Wait States" mask="0xF00" values="CTRLA__FWS"/>
          <bitfield name="ADRWS" caption="Address Wait State Enable" mask="0x4000" values="CTRLA__ADRWS"/>
          <bitfield name="AUTOWS" caption="Automatic Wait State Enable." mask="0x8000" values="CTRLA__AUTOWS"/>
          <bitfield name="RDBUFWS" caption="Read Buffer Wait StatesPer AHB port control of deterministic or zero wait state read buffer access." mask="0x10000" values="CTRLA__RDBUFWS"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="CTRL B REGISTER">
          <bitfield name="PRM" caption="Set NVM Power Reduction Mode" mask="0x1" values="CTRLB__PRM"/>
          <bitfield name="CHEINV" caption="Cache InvalidateCache invalidation takes 1 clock cycle, but may be delayed by an active read." mask="0x80" values="CTRLB__CHEINV"/>
          <bitfield name="SLP" caption="NVM Power Reduction Mode selection during System Standby Sleep" mask="0x300" values="CTRLB__SLP"/>
          <bitfield name="CHEDIS" caption="Cache Disable" mask="0x10000" values="CTRLB__CHEDIS"/>
          <bitfield name="PREFDIS" caption="Prefetch Disable" mask="0x20000" values="CTRLB__PREFDIS"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear REGISTER">
          <bitfield name="SERR" caption="Flash SEC Interrupt Clear Enable" mask="0x1" values="INTENCLR__SERR"/>
          <bitfield name="CRCDONE" caption="CRC Calculation Done Clear Enable" mask="0x100" values="INTENCLR__CRCDONE"/>
          <bitfield name="CRCERR" caption="CRC Error Clear Enable" mask="0x200" values="INTENCLR__CRCERR"/>
          <bitfield name="FLTCAP" caption="ECC Fault Capture Clear Enable" mask="0x10000" values="INTENCLR__FLTCAP"/>
        </register>
        <register name="INTENSET" offset="0xC" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable SET REGISTER">
          <bitfield name="SERR" caption="Flash SEC Interrupt Set Enable" mask="0x1" values="INTENSET__SERR"/>
          <bitfield name="CRCDONE" caption="CRC Calculation Done Set Enable" mask="0x100" values="INTENSET__CRCDONE"/>
          <bitfield name="CRCERR" caption="CRC Error Set Enable" mask="0x200" values="INTENSET__CRCERR"/>
          <bitfield name="FLTCAP" caption="ECC Fault Capture Set Enable" mask="0x10000" values="INTENSET__FLTCAP"/>
        </register>
        <register name="INTFLAG" offset="0x10" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag REGISTER">
          <bitfield name="SERR" caption="Flash SEC Interrupt Flag" mask="0x1" values="INTFLAG__SERR"/>
          <bitfield name="CRCDONE" caption="CRC Calculation Done Flag" mask="0x100" values="INTFLAG__CRCDONE"/>
          <bitfield name="CRCERR" caption="CRC Error Flag" mask="0x200" values="INTFLAG__CRCERR"/>
          <bitfield name="FLTCAP" caption="ECC Fault Capture Flag" mask="0x10000" values="INTFLAG__FLTCAP"/>
        </register>
        <register name="INTFLAGSET" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAGSET" initval="0x00000000" caption="Interrupt Flag Set REGISTER">
          <bitfield name="SERR" caption="Flash SEC Interrupt Flag" mask="0x1" values="INTFLAGSET__SERR"/>
          <bitfield name="CRCDONE" caption="CRC Calculation Done Flag" mask="0x100" values="INTFLAGSET__CRCDONE"/>
          <bitfield name="CRCERR" caption="CRC Error Flag" mask="0x200" values="INTFLAGSET__CRCERR"/>
          <bitfield name="FLTCAP" caption="ECC Fault Capture Flag" mask="0x10000" values="INTFLAGSET__FLTCAP"/>
        </register>
        <register name="STATUS" offset="0x18" rw="R" size="4" initval="0xE0000000" caption="Status REGISTER">
          <bitfield name="PRM" caption="NVM Power Reduction Mode Status" mask="0x1" values="STATUS__PRM"/>
        </register>
        <register name="DBGCTRL" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="Debug Control CTRL REGISTER">
          <bitfield name="CRCRUN" caption="CRC Debug Run Enable" mask="0x1" values="DBGCTRL__CRCRUN"/>
          <bitfield name="DBGECC" caption="Debug ECC ModeECC errors from debugger reads are:" mask="0x6" values="DBGCTRL__DBGECC"/>
        </register>
        <register name="ECCCTRL" offset="0x20" rw="RW" size="4" initval="0x00000040" caption="ECC Control REGISTER">
          <bitfield name="ECCCTL" caption="NVM ECC Mode Control - restricts one or more NVMOPs" mask="0x30" values="ECCCTRL__ECCCTL"/>
          <bitfield name="ECCUNLCK" caption="NVM ECC Mode Control Unlock" mask="0x40" values="ECCCTRL__ECCUNLCK"/>
          <bitfield name="SECCNT" caption="Flash SEC Count" mask="0xFF00"/>
        </register>
        <register name="CRCCTRL" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="CRC Control REGISTER">
          <bitfield name="CRCRST" caption="CRC Reset" mask="0x1" values="CRCCTRL__CRCRST"/>
          <bitfield name="CRCEN" caption="Start CRC Calculation" mask="0x2" values="CRCCTRL__CRCEN"/>
          <bitfield name="RUNSTDBY" caption="CRC Run in Standby" mask="0x20" values="CRCCTRL__RUNSTDBY"/>
        </register>
        <register name="CRCMODE" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="CRC MODE REGISTER">
          <bitfield name="PLEN32" caption="Polynomial Length Select" mask="0x1000" values="CRCMODE__PLEN32"/>
          <bitfield name="AUTOR" caption="CRC Auto Repeat" mask="0x2000" values="CRCMODE__AUTOR"/>
          <bitfield name="ROUT" caption="CRC Reflected Output" mask="0x4000" values="CRCMODE__ROUT"/>
          <bitfield name="RIN" caption="CRC Reflected Input" mask="0x8000" values="CRCMODE__RIN"/>
          <bitfield name="PERIOD" caption="Read Period in PerCLK counts" mask="0xFFF0000"/>
        </register>
