zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00064.atdf
            <register name="KEYVAL_CE_S_CR3" offset="0x46C" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_S_CR3" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_S_CR4" offset="0x470" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_S_CR4" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_S_CR5" offset="0x474" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_S_CR5" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_S_CR6" offset="0x478" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_S_CR6" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_S_CR7" offset="0x47C" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_S_CR7" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_S0" offset="0x480" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_S0" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_S1" offset="0x484" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_S1" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_S2" offset="0x488" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_S2" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_S3" offset="0x48C" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_S3" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_S4" offset="0x490" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_S4" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_S5" offset="0x494" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_S5" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_S6" offset="0x498" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_S6" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_S7" offset="0x49C" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_S7" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_NS_CR0" offset="0x4A0" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_NS_CR0" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_NS_CR1" offset="0x4A4" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_NS_CR1" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_NS_CR2" offset="0x4A8" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_NS_CR2" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_NS_CR3" offset="0x4AC" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_NS_CR3" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_NS_CR4" offset="0x4B0" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_NS_CR4" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_NS_CR5" offset="0x4B4" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_NS_CR5" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_NS_CR6" offset="0x4B8" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_NS_CR6" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_NS_CR7" offset="0x4BC" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_NS_CR7" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_NS0" offset="0x4C0" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_NS0" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_NS1" offset="0x4C4" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_NS1" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_NS2" offset="0x4C8" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_NS2" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_NS3" offset="0x4CC" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_NS3" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_NS4" offset="0x4D0" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_NS4" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_NS5" offset="0x4D4" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_NS5" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_NS6" offset="0x4D8" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_NS6" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_CE_NS7" offset="0x4DC" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_NS7" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_PRG_PG0" offset="0x4E0" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_PRG_PG0" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_PRG_PG1" offset="0x4E4" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_PRG_PG1" caption="" mask="0xFFFFFFFF"/>
            </register>
