zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00064.atdf
            <register name="KEYVAL_DAL_EL6" offset="0x558" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_DAL_EL6" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="KEYVAL_DAL_EL7" offset="0x55C" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_DAL_EL7" caption="" mask="0xFFFFFFFF"/>
            </register>
            <register name="PUF_AC" offset="0xC00" rw="RW" size="4" count="249" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="PUF_AC" caption="" mask="0xFFFFFFFF"/>
            </register>
        </register-group>
        <register-group name="FUSES_BOOTCFG1" caption="Defines FUSES module data">
            <register name="DEVSIGN" offset="0xC" rw="RW" size="4" initval="0xFFFFFFFF" caption="DEVSIGN">
            <bitfield name="SEQ" caption="Sequence number" mask="0x0000FFFF"/>
            <bitfield name="SEQBAR" caption="Sequence number BAR" mask="0xFFFF0000"/>
            </register>
            <register name="BOOT_FLAG" offset="0x800" rw="RW" size="4" initval="0xFFFFFFF9" caption="BOOT CODE FLAGS REGISTER">
            <bitfield name="PUFRETRY" caption="PUF Retry" mask="0x2"/>
            <bitfield name="PUFSTARTUP" caption="PUF Start Up Mode" mask="0x4"/>
            <bitfield name="DICEDIS" caption="Device Identifier Composition Engine Disable" mask="0x8"/>
            <bitfield name="BOOTMODE" caption="Boot Mode" mask="0x10"/>
            <bitfield name="RAM_INIT_ENB" caption="RAM ECC Enable" mask="0x40"/>
            <bitfield name="PUFSCORE" caption="PUF Score Value" mask="0x700" values="BOOT_FLAG__PUFSCORE"/>
            </register>
            <register name="DICE_CDI_INDEX" offset="0x810" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="DICE_CDI_INDEX" caption="" mask="0x7F"/>
            </register>
            <register name="DICE_FW_HASH_INDEX" offset="0x814" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="DICE_FW_HASH_INDEX" caption="" mask="0x7F"/>
            </register>
            <register name="BOOT_GPIOSEL" offset="0x818" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOOT EXTERNAL NOTIFICATION IO PIN REGISTER">
            <bitfield name="GPIOPINSEL" caption="Selects IO Port Pin for Boot External Notification Signal" mask="0x1F"/>
            <bitfield name="GPIOPORTSEL" caption="Selects IO Port for Boot External Notification Signal" mask="0x1E0"/>
            <bitfield name="FLTPOL" caption="Selects IO Port for Boot External Notification Signal" mask="0x200"/>
            <bitfield name="FLTODRAIN" caption="Open Drain Control for Boot External Notification Signal" mask="0x800"/>
            <bitfield name="FLTSLEWLIM" caption="Selects Driver Slew Rate Selection for Boot External Notification Signal" mask="0x3000"/>
            </register>
            <register name="H2PB0_NONSECCLRA" offset="0x81C" rw="RW" size="4" initval="0xFFFFFFFE" caption="Non-Security Clear Register A">
            <bitfield name="NONSEC0" caption="non-security bit for APB Slave k, k=0..31" mask="0x1"/>
            <bitfield name="NONSEC1" caption="non-security bit for APB Slave k, k=0..31" mask="0x2"/>
            <bitfield name="NONSEC2" caption="non-security bit for APB Slave k, k=0..31" mask="0x4"/>
            <bitfield name="NONSEC3" caption="non-security bit for APB Slave k, k=0..31" mask="0x8"/>
            <bitfield name="NONSEC4" caption="non-security bit for APB Slave k, k=0..31" mask="0x10"/>
            <bitfield name="NONSEC5" caption="non-security bit for APB Slave k, k=0..31" mask="0x20"/>
            <bitfield name="NONSEC6" caption="non-security bit for APB Slave k, k=0..31" mask="0x40"/>
            <bitfield name="NONSEC7" caption="non-security bit for APB Slave k, k=0..31" mask="0x80"/>
            <bitfield name="NONSEC8" caption="non-security bit for APB Slave k, k=0..31" mask="0x100"/>
            <bitfield name="NONSEC9" caption="non-security bit for APB Slave k, k=0..31" mask="0x200"/>
            <bitfield name="NONSEC10" caption="non-security bit for APB Slave k, k=0..31" mask="0x400"/>
            <bitfield name="NONSEC11" caption="non-security bit for APB Slave k, k=0..31" mask="0x800"/>
            <bitfield name="NONSEC12" caption="non-security bit for APB Slave k, k=0..31" mask="0x1000"/>
            <bitfield name="NONSEC13" caption="non-security bit for APB Slave k, k=0..31" mask="0x2000"/>
            <bitfield name="NONSEC14" caption="non-security bit for APB Slave k, k=0..31" mask="0x4000"/>
            <bitfield name="NONSEC15" caption="non-security bit for APB Slave k, k=0..31" mask="0x8000"/>
            <bitfield name="NONSEC16" caption="non-security bit for APB Slave k, k=0..31" mask="0x10000"/>
            <bitfield name="NONSEC17" caption="non-security bit for APB Slave k, k=0..31" mask="0x20000"/>
            <bitfield name="NONSEC18" caption="non-security bit for APB Slave k, k=0..31" mask="0x40000"/>
            <bitfield name="NONSEC19" caption="non-security bit for APB Slave k, k=0..31" mask="0x80000"/>
            <bitfield name="NONSEC20" caption="non-security bit for APB Slave k, k=0..31" mask="0x100000"/>
            <bitfield name="NONSEC21" caption="non-security bit for APB Slave k, k=0..31" mask="0x200000"/>
            <bitfield name="NONSEC22" caption="non-security bit for APB Slave k, k=0..31" mask="0x400000"/>
            <bitfield name="NONSEC23" caption="non-security bit for APB Slave k, k=0..31" mask="0x800000"/>
            <bitfield name="NONSEC24" caption="non-security bit for APB Slave k, k=0..31" mask="0x1000000"/>
            <bitfield name="NONSEC25" caption="non-security bit for APB Slave k, k=0..31" mask="0x2000000"/>
            <bitfield name="NONSEC26" caption="non-security bit for APB Slave k, k=0..31" mask="0x4000000"/>
            <bitfield name="NONSEC27" caption="non-security bit for APB Slave k, k=0..31" mask="0x8000000"/>
            <bitfield name="NONSEC28" caption="non-security bit for APB Slave k, k=0..31" mask="0x10000000"/>
            <bitfield name="NONSEC29" caption="non-security bit for APB Slave k, k=0..31" mask="0x20000000"/>
            <bitfield name="NONSEC30" caption="non-security bit for APB Slave k, k=0..31" mask="0x40000000"/>
            <bitfield name="NONSEC31" caption="non-security bit for APB Slave k, k=0..31" mask="0x80000000"/>
            </register>
            <register name="H2PB0_NONSECSETA" offset="0x820" rw="RW" size="4" initval="0x00000001" caption="Non-Security SET Register A">
            <bitfield name="NONSEC0" caption="non-security bit for APB Slave k, k=0..31" mask="0x1"/>
            <bitfield name="NONSEC1" caption="non-security bit for APB Slave k, k=0..31" mask="0x2"/>
            <bitfield name="NONSEC2" caption="non-security bit for APB Slave k, k=0..31" mask="0x4"/>
            <bitfield name="NONSEC3" caption="non-security bit for APB Slave k, k=0..31" mask="0x8"/>
            <bitfield name="NONSEC4" caption="non-security bit for APB Slave k, k=0..31" mask="0x10"/>
            <bitfield name="NONSEC5" caption="non-security bit for APB Slave k, k=0..31" mask="0x20"/>
            <bitfield name="NONSEC6" caption="non-security bit for APB Slave k, k=0..31" mask="0x40"/>
            <bitfield name="NONSEC7" caption="non-security bit for APB Slave k, k=0..31" mask="0x80"/>
            <bitfield name="NONSEC8" caption="non-security bit for APB Slave k, k=0..31" mask="0x100"/>
            <bitfield name="NONSEC9" caption="non-security bit for APB Slave k, k=0..31" mask="0x200"/>
            <bitfield name="NONSEC10" caption="non-security bit for APB Slave k, k=0..31" mask="0x400"/>
            <bitfield name="NONSEC11" caption="non-security bit for APB Slave k, k=0..31" mask="0x800"/>
            <bitfield name="NONSEC12" caption="non-security bit for APB Slave k, k=0..31" mask="0x1000"/>
            <bitfield name="NONSEC13" caption="non-security bit for APB Slave k, k=0..31" mask="0x2000"/>
            <bitfield name="NONSEC14" caption="non-security bit for APB Slave k, k=0..31" mask="0x4000"/>
            <bitfield name="NONSEC15" caption="non-security bit for APB Slave k, k=0..31" mask="0x8000"/>
            <bitfield name="NONSEC16" caption="non-security bit for APB Slave k, k=0..31" mask="0x10000"/>
            <bitfield name="NONSEC17" caption="non-security bit for APB Slave k, k=0..31" mask="0x20000"/>
            <bitfield name="NONSEC18" caption="non-security bit for APB Slave k, k=0..31" mask="0x40000"/>
            <bitfield name="NONSEC19" caption="non-security bit for APB Slave k, k=0..31" mask="0x80000"/>
            <bitfield name="NONSEC20" caption="non-security bit for APB Slave k, k=0..31" mask="0x100000"/>
            <bitfield name="NONSEC21" caption="non-security bit for APB Slave k, k=0..31" mask="0x200000"/>
            <bitfield name="NONSEC22" caption="non-security bit for APB Slave k, k=0..31" mask="0x400000"/>
            <bitfield name="NONSEC23" caption="non-security bit for APB Slave k, k=0..31" mask="0x800000"/>
            <bitfield name="NONSEC24" caption="non-security bit for APB Slave k, k=0..31" mask="0x1000000"/>
            <bitfield name="NONSEC25" caption="non-security bit for APB Slave k, k=0..31" mask="0x2000000"/>
            <bitfield name="NONSEC26" caption="non-security bit for APB Slave k, k=0..31" mask="0x4000000"/>
            <bitfield name="NONSEC27" caption="non-security bit for APB Slave k, k=0..31" mask="0x8000000"/>
            <bitfield name="NONSEC28" caption="non-security bit for APB Slave k, k=0..31" mask="0x10000000"/>
            <bitfield name="NONSEC29" caption="non-security bit for APB Slave k, k=0..31" mask="0x20000000"/>
            <bitfield name="NONSEC30" caption="non-security bit for APB Slave k, k=0..31" mask="0x40000000"/>
            <bitfield name="NONSEC31" caption="non-security bit for APB Slave k, k=0..31" mask="0x80000000"/>
            </register>
