zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_gc00/atdf/PIC32CM5112GC00064.atdf
        <register name="CLKMSK" offset="0x3C" rw="RW" size="4" count="9" initval="0x00000000" caption="Peripheral Clock Enable Mask n Register">
          <bitfield name="MASK0" caption="Peripheral Clock Enable Mask" mask="0x1" values="CLKMSK__MASK"/>
          <bitfield name="MASK1" caption="Peripheral Clock Enable Mask" mask="0x2" values="CLKMSK__MASK"/>
          <bitfield name="MASK2" caption="Peripheral Clock Enable Mask" mask="0x4" values="CLKMSK__MASK"/>
          <bitfield name="MASK3" caption="Peripheral Clock Enable Mask" mask="0x8" values="CLKMSK__MASK"/>
          <bitfield name="MASK4" caption="Peripheral Clock Enable Mask" mask="0x10" values="CLKMSK__MASK"/>
          <bitfield name="MASK5" caption="Peripheral Clock Enable Mask" mask="0x20" values="CLKMSK__MASK"/>
          <bitfield name="MASK6" caption="Peripheral Clock Enable Mask" mask="0x40" values="CLKMSK__MASK"/>
          <bitfield name="MASK7" caption="Peripheral Clock Enable Mask" mask="0x80" values="CLKMSK__MASK"/>
          <bitfield name="MASK8" caption="Peripheral Clock Enable Mask" mask="0x100" values="CLKMSK__MASK"/>
          <bitfield name="MASK9" caption="Peripheral Clock Enable Mask" mask="0x200" values="CLKMSK__MASK"/>
          <bitfield name="MASK10" caption="Peripheral Clock Enable Mask" mask="0x400" values="CLKMSK__MASK"/>
          <bitfield name="MASK11" caption="Peripheral Clock Enable Mask" mask="0x800" values="CLKMSK__MASK"/>
          <bitfield name="MASK12" caption="Peripheral Clock Enable Mask" mask="0x1000" values="CLKMSK__MASK"/>
          <bitfield name="MASK13" caption="Peripheral Clock Enable Mask" mask="0x2000" values="CLKMSK__MASK"/>
          <bitfield name="MASK14" caption="Peripheral Clock Enable Mask" mask="0x4000" values="CLKMSK__MASK"/>
          <bitfield name="MASK15" caption="Peripheral Clock Enable Mask" mask="0x8000" values="CLKMSK__MASK"/>
          <bitfield name="MASK16" caption="Peripheral Clock Enable Mask" mask="0x10000" values="CLKMSK__MASK"/>
          <bitfield name="MASK17" caption="Peripheral Clock Enable Mask" mask="0x20000" values="CLKMSK__MASK"/>
          <bitfield name="MASK18" caption="Peripheral Clock Enable Mask" mask="0x40000" values="CLKMSK__MASK"/>
          <bitfield name="MASK19" caption="Peripheral Clock Enable Mask" mask="0x80000" values="CLKMSK__MASK"/>
          <bitfield name="MASK20" caption="Peripheral Clock Enable Mask" mask="0x100000" values="CLKMSK__MASK"/>
          <bitfield name="MASK21" caption="Peripheral Clock Enable Mask" mask="0x200000" values="CLKMSK__MASK"/>
          <bitfield name="MASK22" caption="Peripheral Clock Enable Mask" mask="0x400000" values="CLKMSK__MASK"/>
          <bitfield name="MASK23" caption="Peripheral Clock Enable Mask" mask="0x800000" values="CLKMSK__MASK"/>
          <bitfield name="MASK24" caption="Peripheral Clock Enable Mask" mask="0x1000000" values="CLKMSK__MASK"/>
          <bitfield name="MASK25" caption="Peripheral Clock Enable Mask" mask="0x2000000" values="CLKMSK__MASK"/>
          <bitfield name="MASK26" caption="Peripheral Clock Enable Mask" mask="0x4000000" values="CLKMSK__MASK"/>
          <bitfield name="MASK27" caption="Peripheral Clock Enable Mask" mask="0x8000000" values="CLKMSK__MASK"/>
          <bitfield name="MASK28" caption="Peripheral Clock Enable Mask" mask="0x10000000" values="CLKMSK__MASK"/>
          <bitfield name="MASK29" caption="Peripheral Clock Enable Mask" mask="0x20000000" values="CLKMSK__MASK"/>
          <bitfield name="MASK30" caption="Peripheral Clock Enable Mask" mask="0x40000000" values="CLKMSK__MASK"/>
          <bitfield name="MASK31" caption="Peripheral Clock Enable Mask" mask="0x80000000" values="CLKMSK__MASK"/>
        </register>
      </register-group>
      <value-group name="INTENCLR__CKRDY">
        <value name="0" caption="The Clock Ready interrupt is disabled" value="0"/>
        <value name="1" caption="The Clock Ready interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="INTENSET__CKRDY">
        <value name="0" caption="The Clock Ready interrupt is disabled." value="0"/>
        <value name="1" caption="The Clock Ready interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="CLKDIV__DIV">
        <value name="DIV1" caption="Divide by 1" value="1"/>
        <value name="DIV2" caption="Divide by 2" value="2"/>
        <value name="DIV4" caption="Divide by 4" value="4"/>
        <value name="DIV8" caption="Divide by 8" value="8"/>
        <value name="DIV16" caption="Divide by 16" value="16"/>
        <value name="DIV32" caption="Divide by 32" value="32"/>
        <value name="DIV64" caption="Divide by 64" value="64"/>
        <value name="DIV128" caption="Divide by 128" value="128"/>
      </value-group>
      <value-group name="CLKMSK__MASK">
        <value name="0" caption="Peripheral clock mclk_clk_periph[n*32+x] stopped" value="0"/>
        <value name="1" caption="Peripheral clock mclk_clk_periph[n*32+x] enabled" value="1"/>
      </value-group>
    </module>
    <module name="MCRAMC" id="04921" name2="drm_mcramc_v5" version="5b0" caption="Multi-Channel RAM Controller">
      <register-group name="MCRAMC" caption="Multi-Channel RAM Controller">
        <register name="MCRAMC_CTRLA" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000002" caption="Control Enable A Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" values="MCRAMC_CTRLA__SWRST"/>
          <bitfield name="ENABLE" caption="ECC Decoder Enable" mask="0x2" values="MCRAMC_CTRLA__ENABLE"/>
          <bitfield name="PRIV" caption="Priviledged Access Enable" mask="0x4"/>
          <bitfield name="WS" caption="Wait State Enable" mask="0x100"/>
        </register>
        <register name="MCRAMC_INTENCLR" offset="0x8" rw="RW" size="4" access-size="4" atomic-op="clear:MCRAMC_INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear Register">
          <bitfield name="SERREN" caption="Single Bit Error Interrupt Enable, Clear" mask="0x1"/>
          <bitfield name="DERREN" caption="Double Bit Error Interrupt Enable, Clear" mask="0x2"/>
        </register>
        <register name="MCRAMC_INTENSET" offset="0xC" rw="RW" size="4" access-size="4" atomic-op="set:MCRAMC_INTENSET" initval="0x00000000" caption="Interrupt Enable Set Register">
          <bitfield name="SERREN" caption="Single Bit Error Interrupt Enable, Set" mask="0x1"/>
          <bitfield name="DERREN" caption="Double Bit Error Interrupt Enable, Set" mask="0x2"/>
        </register>
